Revit 2027 API
PropertyTableEntry Methods
The PropertyTableEntry type exposes the following members.
Methods
Name | Description
Create |  Creates a new PropertyTableEntry object.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsValidPropertyTableEntry |  Function used to check the input data is valid to create PropertyTableEntry object
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
PropertyTableEntry Class
Autodesk.Revit.DB Namespace